app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2022-05-29 16:29:54.153670"], ["updated_at", "2022-05-29 16:29:54.153670"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      redirect_to book_path(@book.id)
      flash[:notice] = "Book was successfully created."
    else
      @books = Book.all